In [32]:
import pandas as pd
import numpy as np

In [33]:
df = pd.read_csv('Customers.csv')

In [34]:
df.head()

   age  income  gender m_status buys
0   25    high    male   single   no
1   25    high    male  married   no
2   35    high    male   single  yes
3   35  medium    male   single  yes
4   30     low  female   single  yes

In [35]:
df.isnull().sum()

age         0
income      0
gender      0
m_status    0
buys        0
dtype: int64

In [36]:
df.income.unique()

array(['high', 'medium', 'low'], dtype=object)

In [37]:
df.income = df.income.replace(['high', 'medium', 'low'],[1,2,3])

In [38]:
df.income.head()

0    1
1    1
2    1
3    2
4    3
Name: income, dtype: int64

In [39]:
df.gender.unique()

array(['male', 'female'], dtype=object)

In [40]:
df.gender = df.gender.replace(['male', 'female'],[1,2])

In [41]:
df.gender.head()

0    1
1    1
2    1
3    1
4    2
Name: gender, dtype: int64

In [42]:
df.m_status.unique()

array(['single', 'married'], dtype=object)

In [43]:
df.m_status = df.m_status.replace(['single', 'married'],[1,2])

In [44]:
df.m_status.head()

0    1
1    2
2    1
3    1
4    1
Name: m_status, dtype: int64

In [45]:
df.buys.unique()

array(['no', 'yes'], dtype=object)

In [46]:
df.buys = df.buys.replace(['no', 'yes'],[1,2])

In [47]:
df.buys.head()

0    1
1    1
2    2
3    2
4    2
Name: buys, dtype: int64

In [48]:
df.head()

   age  income  gender  m_status  buys
0   25       1       1         1     1
1   25       1       1         2     1
2   35       1       1         1     2
3   35       2       1         1     2
4   30       3       2         1     2

In [49]:
df = pd.read_csv('Customers.csv')

In [50]:
df.head()

   age  income  gender m_status buys
0   25    high    male   single   no
1   25    high    male  married   no
2   35    high    male   single  yes
3   35  medium    male   single  yes
4   30     low  female   single  yes

# label Encoding

In [51]:
from sklearn.preprocessing import LabelEncoder

# LabelEncoder = LabelEncoder()

In [54]:
df.income = LabelEncoder.fit_transform(df['income'])

In [55]:
df.income.head()

0    0
1    0
2    0
3    2
4    1
Name: income, dtype: int32

In [57]:
df.m_status = LabelEncoder.fit_transform(df['m_status'])
df.gender = LabelEncoder.fit_transform(df['gender'])
df.buys = LabelEncoder.fit_transform(df['buys'])

In [58]:
df.head()

   age  income  gender  m_status  buys
0   25       0       1         1     0
1   25       0       1         0     0
2   35       0       1         1     1
3   35       2       1         1     1
4   30       1       0         1     1

# One head

In [180]:
df = pd.read_csv('Customers.csv')

In [181]:
df.head()

   age  income  gender m_status buys
0   25    high    male   single   no
1   25    high    male  married   no
2   35    high    male   single  yes
3   35  medium    male   single  yes
4   30     low  female   single  yes

In [184]:
income_dummy_variables = pd.get_dummies(df['income'],drop_first = True)
gender_dummy_variables = pd.get_dummies(df['gender'],drop_first=True)

In [185]:
new_income.head()

   age  gender m_status buys
0   25    male   single   no
1   25    male  married   no
2   35    male   single  yes
3   35    male   single  yes
4   30  female   single  yes

   low  medium
0    0       0
1    0       0
2    0       0
3    0       1
4    1       0

In [187]:
new_df = df.drop('income',axis=1)
new_df = df.drop('gender',axis=1)

In [188]:
df = pd.concat([new_df,income_dummy_variables],axis=1)

In [189]:
df.head()

   age  income m_status buys  low  medium
0   25    high   single   no    0       0
1   25    high  married   no    0       0
2   35    high   single  yes    0       0
3   35  medium   single  yes    0       1
4   30     low   single  yes    1       0

In [152]:
a = pd.get_dummies(df['income']).head()

In [153]:
a.head()

   high  low  medium
0     1    0       0
1     1    0       0
2     1    0       0
3     0    0       1
4     0    1       0

In [157]:
m = pd.concat(df[a, new_income],axis = 1)

TypeError: '(   high  low  medium
0     1    0       0
1     1    0       0
2     1    0       0
3     0    0       1
4     0    1       0,     age  gender m_status buys
0    25    male   single   no
1    25    male  married   no
2    35    male   single  yes
3    35    male   single  yes
4    30  female   single  yes
5    32  female   single   no
6    22  female  married  yes
7    22    male  married   no
8    25  female   single  yes
9    35  female  married  yes
10   25  female   single  yes
11   35    male  married  yes
12   22  female   single  yes
13   35    male  married   no
14   25    male   single   no
15   25  female  married  yes
16   35    male  married  yes
17   22  female   single  yes
18   25  female  married  yes
19   30    male   single  yes
20   30  female  married   no
21   25    male   single  yes)' is an invalid key

In [158]:
df.head()

   age  income  gender m_status buys
0   25    high    male   single   no
1   25    high    male  married   no
2   35    high    male   single  yes
3   35  medium    male   single  yes
4   30     low  female   single  yes

In [145]:

new_gender = df.drop('gender',axis = 1)
new_m_status = df.drop('m_status',axis = 1)
new_buys = df.drop('buys',axis = 1)

In [147]:
df.head()

   age  income  gender m_status buys
0   25    high    male   single   no
1   25    high    male  married   no
2   35    high    male   single  yes
3   35  medium    male   single  yes
4   30     low  female   single  yes

In [140]:
b = pd.get_dummies(df['gender']).head()

In [141]:
c = pd.get_dummies(df['m_status']).head()

In [142]:
d = pd.get_dummies(df['buys']).head()

In [143]:
df.head()

   age  income  gender m_status buys
0   25    high    male   single   no
1   25    high    male  married   no
2   35    high    male   single  yes
3   35  medium    male   single  yes
4   30     low  female   single  yes

In [144]:
new_income = df.drop('income',axis = 1)
new_gender = df.drop('gender',axis = 1)
new_m_status = df.drop('m_status',axis = 1)
new_buys = df.drop('buys',axis = 1)

In [134]:
df.head()

   age  income  gender m_status buys
0   25    high    male   single   no
1   25    high    male  married   no
2   35    high    male   single  yes
3   35  medium    male   single  yes
4   30     low  female   single  yes

In [128]:
m = pd.concat([a,b,c,d],axis = 1)

In [129]:
df.head()

   age  income  gender m_status buys
0   25    high    male   single   no
1   25    high    male  married   no
2   35    high    male   single  yes
3   35  medium    male   single  yes
4   30     low  female   single  yes